; This config is autogenerated with pyrmont static skin generator.
; It's not recommended to edit this file manually.

[Rainmeter]
    Update=1000
    AccurateText=1
    DefaultUpdateDivider=60
    Group=AccentColorDependent

; TODO:
; Все имеющиеся на Хабре ленты публикаций доступны в формате RSS, включая ленты:
;   разделов лучших публикаций сайта (за сутки, за неделю, за месяц);
;   разделов всех подряд публикаций сайта (без порога, ≥10, ≥25, ≥50, ≥100);
;   разделов лучших публикаций потока (за сутки, за неделю, за месяц);
;   разделов всех подряд публикаций потока (без порога, ≥10, ≥25, ≥50, ≥100);
;   разделов лучших публикаций хаба (за сутки, за неделю, за месяц);
;   разделов всех подряд публикаций хаба (без порога, ≥10, ≥25, ≥50, ≥100);
;   комментариев к каждой публикации;
;   каждого результата поиска;
;   каждой метки к публикации.
; Чтобы получить ссылку на интересующую вас RSS-ленту, откройте исходный код страницы с интересующей
; вас лентой и найдите в нем элемент type="application/rss+xml". Рядом с ним будет представлена
; ссылка на RSS-ленту, которую вы сможете скопировать и добавить в свой RSS-ридер.
; Вы можете добавить к этой ссылке ключи ?with_hubs=true: и ?with_tags=true:,
; если желаете видеть в этой RSS-ленте хабы и метки публикаций соответственно.
; Чтобы расширить лимит RSS-ленты до 100 постов, добавьте к ссылке на вашу ленту параметр ?limit=100.

[Variables]
    @include-cfg=#@#Config.inc
    @include-frostedglass=#@#FrostedGlass.inc
    @include-translations=#@#Langs/#lang#.inc
    ; size
    skinw=(#s# * 550)
    skinh=(#s# * 365)

    ; regex for parsing 1 story section.
    q=(?(?=.*<item>).*<title><\!\[CDATA\[(.*)\]\]>.*<link>(.*)<\/link>.*<\/item>.*)
    ;				               1 title			         2 link

    title=Habr
    main-url=https://habr.com/#lang-code#/
    
    rss-url-en=https://habr.com/en/rss/all/all/
    rss-url-ru=https://habr.com/ru/rss/best/daily/
    rss-url=#rss-url-[#lang_code]#
    link1=[RSS1Link]
    link2=[RSS2Link]
    link3=[RSS3Link]
    link4=[RSS4Link]
    link5=[RSS5Link]
    link6=[RSS6Link]
    link7=[RSS7Link]
    link8=[RSS8Link]
    link9=[RSS9Link]
    link10=[RSS10Link]

; #################### MEASURES

[RSS]
    Measure=WebParser
    Url=#rss-url#
    UpdateRate=1
    FinishAction=[!UpdateMeasureGroup Lines][!UpdateMeter *][!Redraw]
    RegExp=(?siU)#q##q##q##q##q##q##q##q##q##q##q##q##q##q##q##q##q##q##q##q#

[RSS1]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=1
    Substitute="":"#loading#"

[RSS2]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=3
    Substitute="":"#loading#"

[RSS3]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=5
    Substitute="":"#loading#"

[RSS4]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=7
    Substitute="":"#loading#"

[RSS5]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=9
    Substitute="":"#loading#"

[RSS6]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=11
    Substitute="":"#loading#"

[RSS7]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=13
    Substitute="":"#loading#"

[RSS8]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=15
    Substitute="":"#loading#"

[RSS9]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=17
    Substitute="":"#loading#"

[RSS10]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=19
    Substitute="":"#loading#"

[RSS11]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=21
    Substitute="":"#loading#"

[RSS12]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=23
    Substitute="":"#loading#"

[RSS13]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=25
    Substitute="":"#loading#"

[RSS14]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=27
    Substitute="":"#loading#"

[RSS15]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=29
    Substitute="":"#loading#"

[RSS16]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=31
    Substitute="":"#loading#"

[RSS17]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=33
    Substitute="":"#loading#"

[RSS18]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=35
    Substitute="":"#loading#"

[RSS19]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=37
    Substitute="":"#loading#"

[RSS20]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=39
    Substitute="":"#loading#"

[RSS1Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=2

[RSS2Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=4

[RSS3Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=6

[RSS4Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=8

[RSS5Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=10

[RSS6Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=12

[RSS7Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=14

[RSS8Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=16

[RSS9Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=18

[RSS10Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=20

[RSS11Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=22

[RSS12Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=24

[RSS13Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=26

[RSS14Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=28

[RSS15Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=30

[RSS16Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=32

[RSS17Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=34

[RSS18Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=36

[RSS19Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=38

[RSS20Link]
    Measure=WebParser
    Group=Lines
    Url=[RSS]
    StringIndex=40

; #################### METERS

[BG]
    Meter=Shape
    MeterStyle=BackgroundStyle

[RSSHeader]
    Meter=String
    MeterStyle=RegularStringStyle
    X=(#s# * 15)
    Y=(#s# * 15)
    FontSize=(#s# * 20)
    Text=#title#
    InlineSetting=Color | #color-accent#
    InlinePattern=\p{Lu}
    LeftMouseUpAction=["#main-url#"]
    ToolTipText="Open in browser"
    UpdateDivider=-1

[ListDown]
    Meter=String
    MeterStyle=RegularStringStyle
    X=(#skinw# - [RSSHeader:X])
    Y=r
    FontSize=(#s# * 20)
    FontColor=#color-accent#
    StringAlign=Right
    Text=">"
    UpdateDivider=-1
    LeftMouseUpAction=[!SetOption RSS1String MeasureName RSS11][!SetVariable link1 "[RSS11link]"][!SetOption RSS2String MeasureName RSS12][!SetVariable link2 "[RSS12link]"][!SetOption RSS3String MeasureName RSS13][!SetVariable link3 "[RSS13link]"][!SetOption RSS4String MeasureName RSS14][!SetVariable link4 "[RSS14link]"][!SetOption RSS5String MeasureName RSS15][!SetVariable link5 "[RSS15link]"][!SetOption RSS6String MeasureName RSS16][!SetVariable link6 "[RSS16link]"][!SetOption RSS7String MeasureName RSS17][!SetVariable link7 "[RSS17link]"][!SetOption RSS8String MeasureName RSS18][!SetVariable link8 "[RSS18link]"][!SetOption RSS9String MeasureName RSS19][!SetVariable link9 "[RSS19link]"][!SetOption RSS10String MeasureName RSS20][!SetVariable link10 "[RSS20link]"][!HideMeter ListDown][!ShowMeter ListUp][!UpdateMeterGroup RSS][!Redraw]

[ListUp]
    Meter=String
    MeterStyle=RegularStringStyle | ListDown
    X=r
    Y=r
    Text="<"
    Hidden=1
    LeftMouseUpAction=[!SetOption RSS1String MeasureName RSS1][!SetVariable link1 "[RSS1link]"][!SetOption RSS2String MeasureName RSS2][!SetVariable link2 "[RSS2link]"][!SetOption RSS3String MeasureName RSS3][!SetVariable link3 "[RSS3link]"][!SetOption RSS4String MeasureName RSS4][!SetVariable link4 "[RSS4link]"][!SetOption RSS5String MeasureName RSS5][!SetVariable link5 "[RSS5link]"][!SetOption RSS6String MeasureName RSS6][!SetVariable link6 "[RSS6link]"][!SetOption RSS7String MeasureName RSS7][!SetVariable link7 "[RSS7link]"][!SetOption RSS8String MeasureName RSS8][!SetVariable link8 "[RSS8link]"][!SetOption RSS9String MeasureName RSS9][!SetVariable link9 "[RSS9link]"][!SetOption RSS10String MeasureName RSS10][!SetVariable link10 "[RSS10link]"][!HideMeter ListUp][!ShowMeter ListDown][!UpdateMeterGroup RSS][!Redraw]

[RSS1String]
    Meter=String
    MeterStyle=RegularStringStyle
    MeasureName=RSS1
    X=[RSSHeader:X]
    Y=(#s# * 65)
    H=(#s# * 25)
    W=(#skinw# - (#s# * 35))
    InlinePattern=^\[.*\]
    InlineSetting=Color | #color-accent#
    StringAlign=LeftCenter
    SolidColor=#color-highlight#,10
    LeftMouseUpAction=[!SetOption #CURRENTSECTION# SolidColor #color-highlight#,#opacity-highlight#][!UpdateMeter #CURRENTSECTION#][!Redraw]["#link1#"]
    MouseLeaveAction=[!SetOption #CURRENTSECTION# SolidColor #color-highlight#,10][!UpdateMeter #CURRENTSECTION#][!Redraw]
    MouseOverAction=[!SetOption #CURRENTSECTION# SolidColor #color-highlight#,#opacity-highlight#][!UpdateMeter #CURRENTSECTION#][!Redraw]
    LeftMouseDownAction=[!SetOption #CURRENTSECTION# SolidColor #color-accent#][!UpdateMeter #CURRENTSECTION# ][!Redraw]
    ToolTipText=%1
    Group=RSS


[RSS2String]
    Meter=String
    MeterStyle=RegularStringStyle | RSS1String
    MeasureName=RSS2
    Y=(#s# * 30)r
    LeftMouseUpAction=[!SetOption #CURRENTSECTION# SolidColor #color-highlight#,#opacity-highlight#][!UpdateMeter #CURRENTSECTION#][!Redraw]["#link2#"]
    Group=RSS

[RSS3String]
    Meter=String
    MeterStyle=RegularStringStyle | RSS1String
    MeasureName=RSS3
    Y=(#s# * 30)r
    LeftMouseUpAction=[!SetOption #CURRENTSECTION# SolidColor #color-highlight#,#opacity-highlight#][!UpdateMeter #CURRENTSECTION#][!Redraw]["#link3#"]
    Group=RSS

[RSS4String]
    Meter=String
    MeterStyle=RegularStringStyle | RSS1String
    MeasureName=RSS4
    Y=(#s# * 30)r
    LeftMouseUpAction=[!SetOption #CURRENTSECTION# SolidColor #color-highlight#,#opacity-highlight#][!UpdateMeter #CURRENTSECTION#][!Redraw]["#link4#"]
    Group=RSS

[RSS5String]
    Meter=String
    MeterStyle=RegularStringStyle | RSS1String
    MeasureName=RSS5
    Y=(#s# * 30)r
    LeftMouseUpAction=[!SetOption #CURRENTSECTION# SolidColor #color-highlight#,#opacity-highlight#][!UpdateMeter #CURRENTSECTION#][!Redraw]["#link5#"]
    Group=RSS

[RSS6String]
    Meter=String
    MeterStyle=RegularStringStyle | RSS1String
    MeasureName=RSS6
    Y=(#s# * 30)r
    LeftMouseUpAction=[!SetOption #CURRENTSECTION# SolidColor #color-highlight#,#opacity-highlight#][!UpdateMeter #CURRENTSECTION#][!Redraw]["#link6#"]
    Group=RSS

[RSS7String]
    Meter=String
    MeterStyle=RegularStringStyle | RSS1String
    MeasureName=RSS7
    Y=(#s# * 30)r
    LeftMouseUpAction=[!SetOption #CURRENTSECTION# SolidColor #color-highlight#,#opacity-highlight#][!UpdateMeter #CURRENTSECTION#][!Redraw]["#link7#"]
    Group=RSS

[RSS8String]
    Meter=String
    MeterStyle=RegularStringStyle | RSS1String
    MeasureName=RSS8
    Y=(#s# * 30)r
    LeftMouseUpAction=[!SetOption #CURRENTSECTION# SolidColor #color-highlight#,#opacity-highlight#][!UpdateMeter #CURRENTSECTION#][!Redraw]["#link8#"]
    Group=RSS

[RSS9String]
    Meter=String
    MeterStyle=RegularStringStyle | RSS1String
    MeasureName=RSS9
    Y=(#s# * 30)r
    LeftMouseUpAction=[!SetOption #CURRENTSECTION# SolidColor #color-highlight#,#opacity-highlight#][!UpdateMeter #CURRENTSECTION#][!Redraw]["#link9#"]
    Group=RSS

[RSS10String]
    Meter=String
    MeterStyle=RegularStringStyle | RSS1String
    MeasureName=RSS10
    Y=(#s# * 30)r
    LeftMouseUpAction=[!SetOption #CURRENTSECTION# SolidColor #color-highlight#,#opacity-highlight#][!UpdateMeter #CURRENTSECTION#][!Redraw]["#link10#"]
    Group=RSS
